#########################################
# Словарь соответствия валют и флагов
currency_flags = {
    "MDL": "\U0001F1F2\U0001F1E9",  # Флаг Молдовы
    "USD": "\U0001F1FA\U0001F1F8",  # Флаг США
    "EUR": "\U0001F1EA\U0001F1FA",  # Флаг Евросоюза
    "GBP": "\U0001F1EC\U0001F1E7",  # Флаг Великобритании
    "JPY": "\U0001F1EF\U0001F1F5",  # Флаг Японии
    "RUB": "\U0001F1F7\U0001F1FA",  # Флаг России
    "RON": "\U0001F1F7\U0001F1F4",  # Флаг Румынии
    "UAH": "\U0001F1FA\U0001F1E6",  # Флаг Украины
    "AED": "\U0001F1E6\U0001F1EA",  # Флаг ОАЭ
    "ALL": "\U0001F1E6\U0001F1F1",  # Флаг Албании
    "AMD": "\U0001F1E6\U0001F1F2",  # Флаг Армении
    "AUD": "\U0001F1E6\U0001F1FA",  # Флаг Австралии
    "AZN": "\U0001F1E6\U0001F1FF",  # Флаг Азербайджана
    "BGN": "\U0001F1E7\U0001F1EC",  # Флаг Болгарии
    "BYN": "\U0001F1E7\U0001F1FE",  # Флаг Беларуси
    "CAD": "\U0001F1E8\U0001F1E6",  # Флаг Канады
    "CHF": "\U0001F1E8\U0001F1ED",  # Флаг Швейцарии
    "CNY": "\U0001F1E8\U0001F1F3",  # Флаг Китая
    "CZK": "\U0001F1E8\U0001F1FF",  # Флаг Чехии
    "DKK": "\U0001F1E9\U0001F1F0",  # Флаг Дании
    "GEL": "\U0001F1EC\U0001F1EA",  # Флаг Грузии
    "HKD": "\U0001F1ED\U0001F1F0",  # Флаг Хорватии
    "HRK": "\U0001F1ED\U0001F1F7",  # Флаг Гонконга
    "HUF": "\U0001F1ED\U0001F1FA",  # Флаг Венгрии
    "ILS": "\U0001F1EE\U0001F1F1",  # Флаг Израиля
    "INR": "\U0001F1EE\U0001F1F3",  # Флаг Индии
    "ISK": "\U0001F1EE\U0001F1F8",  # Флаг Исландии
    "KGS": "\U0001F1F0\U0001F1EC",  # Флаг Кыргызстана
    "KRW": "\U0001F1F0\U0001F1F7",  # Флаг Южной Кореи
    "KWD": "\U0001F1F0\U0001F1FC",  # Флаг Кувейта
    "KZT": "\U0001F1F0\U0001F1FF",  # Флаг Казахстана
    "MKD": "\U0001F1F2\U0001F1F0",  # Флаг Северной Македонии
    "MYR": "\U0001F1F2\U0001F1FE",  # Флаг Малайзии
    "NOK": "\U0001F1F3\U0001F1F4",  # Флаг Норвегии
    "NZD": "\U0001F1F3\U0001F1FF",  # Флаг Новой Зеландии
    "PLN": "\U0001F1F5\U0001F1F1",  # Флаг Польши
    "RSD": "\U0001F1F7\U0001F1F8",  # Флаг Сербии
    "SEK": "\U0001F1F8\U0001F1EA",  # Флаг Швеции
    "TJS": "\U0001F1F9\U0001F1EF",  # Флаг Таджикистана
    "TMT": "\U0001F1F9\U0001F1F2",  # Флаг Туркменистана
    "TRY": "\U0001F1F9\U0001F1F7",  # Флаг Турции
    "UZS": "\U0001F1FA\U0001F1FF",  # Флаг Узбекистана
    "XDR": "\U0001F310"  # Специальные права заимствования (SDR)
}